/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: omito <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/04/23 16:03:23 by omito             #+#    #+#             */
/*   Updated: 2026/04/23 16:57:14 by omito            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

int ft_strlen(char *str)
{
	int	i;
	i = 0;
	{
		while (str[i] != '\0')
			i++;
	}
	return (i);
}

//#include <stdio.h>
//
//int main(void)
//{
//	char test[] = "abcde";
//	printf("文字数は%d\n", ft_strlen(test));
//}	
//	
