/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strjoin.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: omito <omito@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/04/30 23:07:16 by omito             #+#    #+#             */
/*   Updated: 2026/04/30 23:18:29 by omito            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

char	*ft_strjoin(char const *s1, char const *s2)
{
	char	*new_s;
	unsigned int	s_len;

	if (!s2 || !s1)
		return (NULL);

	new_s = 

	//複数の文字列を指定されたセパレーション文字列を挟みながら文字列を結合させる関数。total_len関数で確保するメモリの長さを調べている。
